public class 韩顺平 {
    public static void main(String[] args) {
//        10000000 00000000 00000000 00000100
//        111111111 11111111 11111111 1111110
//        111111111 11111111 11111111 1111101
//        100000000 00000000 00000000 0000010
        System.out.println((-4)>>1);
        System.out.println(8.0/2);
        System.out.println(8.1/3);
        System.out.println(9.9/3);
        //原码 10000000 00000000 00000000 00000101
        //反码 11111111 11111111 11111111 11111010
        //补码 11111111 11111111 11111111 11111011
        //取反 00000000 00000000 00000000 00000100 运算后的补码 记住，如果取反后补码符号位变为0那就把它当做正数对待
        //因为上面为正数，所以补码即为原码
        System.out.println(~-5);
    }
}
